NextFOAM-2404/tutorials/multiphase/interIsoFoam/waveExampleStreamFunction/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30.0;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.15085;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxAlphaCo      0.5;

maxDeltaT       0.5;

functions
{
    line
    {
        type            sets;
        libs            (sampling);
        enabled         true;
        writeControl    onEnd;

        interpolationScheme cellPoint;
        setFormat       raw;
        fixedLocations  false;

        fields
        (
            U alpha.water
        );

        sets
        {
            line1
            {
                type    uniform;
                axis    distance;
                start   ( 1.0 0.005 0.0 );
                end     ( 1.0 0.005 1.0 );
                nPoints 1001;
            }
            line2
            {
                type    uniform;
                axis    distance;
                start   ( 2.0 0.005 0.0 );
                end     ( 2.0 0.005 1.0 );
                nPoints 1001;
            }
            line3
            {
                type    uniform;
                axis    distance;
                start   ( 3.0 0.005 0.0 );
                end     ( 3.0 0.005 1.0 );
                nPoints 1001;
            }
            line4
            {
                type    uniform;
                axis    distance;
                start   ( 5.0 0.005 0.0 );
                end     ( 5.0 0.005 1.0 );
                nPoints 1001;
            }
            line5
            {
                type    uniform;
                axis    distance;
                start   ( 7.5 0.005 0.0 );
                end     ( 7.5 0.005 1.0 );
                nPoints 1001;
            }
            line6
            {
                type    uniform;
                axis    distance;
                start   ( 10.0 0.005 0.0 );
                end     ( 10.0 0.005 1.0 );
                nPoints 1001;
            }
            line7
            {
                type    uniform;
                axis    distance;
                start   ( 12.0 0.005 0.0 );
                end     ( 12.0 0.005 1.0 );
                nPoints 1001;
            }
            line8
            {
                type    uniform;
                axis    distance;
                start   ( 15.0 0.005 0.0 );
                end     ( 15.0 0.005 1.0 );
                nPoints 1001;
            }
            line9
            {
                type    uniform;
                axis    distance;
                start   ( 20.0 0.005 0.0 );
                end     ( 20.0 0.005 1.0 );
                nPoints 1001;
            }
            line10
            {
                type    uniform;
                axis    distance;
                start   ( 28.0 0.005 0.0 );
                end     ( 28.0 0.005 1.0 );
                nPoints 1001;
            }
        }
    }
}


// ************************************************************************* //
